#language: ru

@tree

Функционал: расчет поля Количество (итог) документа Заказ

Как Менеджер по закупкам я хочу
создать заказ 
чтобы проверить корректность расчета поля Количество (итог)   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: расчет поля Количество (итог) документа Заказ
* Открытие формы создания документа
	И Открытие формы создания документа Заказ
* Заполнение шапки документа
	И заполнение шапки Заказа
* Добавление товара
	И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице 'Товары' из выпадающего списка с именем 'ТоварыТовар' я выбираю точное значение "Молоко"
	И я перехожу к следующему реквизиту
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
	И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "10"
	И в таблице 'Товары' я завершаю редактирование строки
	И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице 'Товары' из выпадающего списка с именем 'ТоварыТовар' я выбираю точное значение "Колбаса"
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
	И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "15"
	И в таблице 'Товары' я завершаю редактирование строки
			
* Ожидаемый результат: расчет в поле Количество (итог) корректный
	И элемент формы с именем 'ТоварыИтогКоличество' стал равен "25"
	И я закрываю все окна клиентского приложения
	
Сценарий: расчет поля Количество (итог) документа Заказ при удалении строки
* Открытие формы создания документа
	И Открытие формы создания документа Заказ
* Заполнение шапки документа
	И заполнение шапки Заказа
* Добавление товара
	И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице 'Товары' из выпадающего списка с именем 'ТоварыТовар' я выбираю точное значение "Молоко"
	И я перехожу к следующему реквизиту
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
	И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "10"
	И в таблице 'Товары' я завершаю редактирование строки
	И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице 'Товары' из выпадающего списка с именем 'ТоварыТовар' я выбираю точное значение "Колбаса"
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
	И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "15"
	И в таблице 'Товары' я завершаю редактирование строки
* Удаление строки из табличной части	
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыТовар'
	И я выбираю пункт контекстного меню с именем 'ТоварыКонтекстноеМенюУдалить' на элементе формы с именем 'Товары'
	
* Ожидаемый результат: расчет в поле Количество (итог) корректный
	И элемент формы с именем 'ТоварыИтогКоличество' стал равен "10"
	И я закрываю все окна клиентского приложения
	

Сценарий: расчет поля Количество (итог) документа Заказ при изменении количества в табличной части
* Открытие формы создания документа
	И Открытие формы создания документа Заказ
* Заполнение шапки документа
	И заполнение шапки Заказа
* Добавление товара
	И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице 'Товары' из выпадающего списка с именем 'ТоварыТовар' я выбираю точное значение "Колбаса"
	И я перехожу к следующему реквизиту
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
	И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "5"
	И в таблице 'Товары' я завершаю редактирование строки
* Изменение количества
	И в таблице 'Товары' я выбираю текущую строку
	И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "3"
	И в таблице 'Товары' я завершаю редактирование строки
	
* Ожидаемый результат: расчет в поле Количество (итог) корректный
	И элемент формы с именем 'ТоварыИтогКоличество' стал равен "3"
	И я закрываю все окна клиентского приложения